# Python Pandas

In [3]:
pip install pandas

Requirement already satisfied: pandas in c:\users\manju\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\manju\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\manju\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\manju\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\manju\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\manju\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [8]:
import pandas as pd
import numpy as np

## Series

In [11]:
#Series
pd_series1 = pd.Series([2,4,3,6,2,7,84,4])

In [13]:
pd_series1

0     2
1     4
2     3
3     6
4     2
5     7
6    84
7     4
dtype: int64

In [19]:
pd_series2 = pd.Series(np.array([3,2,6,4,9,7]))

In [21]:
pd_series2

0    3
1    2
2    6
3    4
4    9
5    7
dtype: int32

In [25]:
pd_series3 = pd.Series(np.array([3,2,6,4,9,7]) , index = np.arange(1,17, 3))
pd_series3

1     3
4     2
7     6
10    4
13    9
16    7
dtype: int32

In [31]:
pd_series4 = pd.Series(np.array([3,2,6,4,9,7]) , index = [5,4,7,7,3,9])
pd_series4

5    3
4    2
7    6
7    4
3    9
9    7
dtype: int32

In [33]:
student = {
    'name' : 'mks',
    'age' : 21,
    'class' : '1stsem'
}
type(student)

dict

In [35]:
pd_series5 = pd.Series(student)
pd_series5

name        mks
age          21
class    1stsem
dtype: object

In [37]:
mydict = {
    'a' : [1,2,3,4],
    'b' : [4,5],
    'c' : (6,4,5),
    'd' : {2,5,7}
}
type(mydict)

dict

In [39]:
pd_series6 = pd.Series(mydict)
pd_series6

a    [1, 2, 3, 4]
b          [4, 5]
c       (6, 4, 5)
d       {2, 5, 7}
dtype: object

In [41]:
pd_series4

5    3
4    2
7    6
7    4
3    9
9    7
dtype: int32

### Accessing series elements

In [43]:
pd_series4[2:4]

7    6
7    4
dtype: int32

In [49]:
pd_series4[1:6:2]

4    2
7    4
9    7
dtype: int32

In [55]:
pd_series4[-4:]

7    6
7    4
3    9
9    7
dtype: int32

In [57]:
pd_series6

a    [1, 2, 3, 4]
b          [4, 5]
c       (6, 4, 5)
d       {2, 5, 7}
dtype: object

In [61]:
pd_series6['d']

{2, 5, 7}

In [63]:
pd_series4

5    3
4    2
7    6
7    4
3    9
9    7
dtype: int32

In [73]:
pd_series4[4:7]

3    9
9    7
dtype: int32

In [75]:
pd_series6['b':'d']

b       [4, 5]
c    (6, 4, 5)
d    {2, 5, 7}
dtype: object

In [77]:
pd_series6

a    [1, 2, 3, 4]
b          [4, 5]
c       (6, 4, 5)
d       {2, 5, 7}
dtype: object

In [81]:
pd_series6[['a','d']]

a    [1, 2, 3, 4]
d       {2, 5, 7}
dtype: object

In [83]:
pd_series4

5    3
4    2
7    6
7    4
3    9
9    7
dtype: int32

In [85]:
pd_series4[pd_series4>5]

7    6
3    9
9    7
dtype: int32

In [87]:
pd_series6

a    [1, 2, 3, 4]
b          [4, 5]
c       (6, 4, 5)
d       {2, 5, 7}
dtype: object

In [93]:
pd_series4

5    3
4    2
7    6
7    4
3    9
9    7
dtype: int32

### Operations on series

In [95]:
pd_series4 * 2

5     6
4     4
7    12
7     8
3    18
9    14
dtype: int32

In [97]:
pd_series4

5    3
4    2
7    6
7    4
3    9
9    7
dtype: int32

In [111]:
pd_series7 = pd.Series(np.array([1,2,3,4,5,6]))
pd_series7
pd_series8 = pd.Series(np.array([1,2,3,4,5,6]))
pd_series8
pd_series9 = pd.Series(np.array([1,2,3,4,5,6]))
pd_series9

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int32

In [113]:
pd_series8 + pd_series7 + pd_series9

0     3
1     6
2     9
3    12
4    15
5    18
dtype: int32

### Ranking in the series

In [10]:
pd_series41 = pd.Series(np.array([234,3454,256,575,1332,678]))
pd_series41

0     234
1    3454
2     256
3     575
4    1332
5     678
dtype: int32

In [12]:
pd_series41.rank()

0    1.0
1    6.0
2    2.0
3    3.0
4    5.0
5    4.0
dtype: float64

### Sorting series

In [16]:
pd_series41

0     234
1    3454
2     256
3     575
4    1332
5     678
dtype: int32

In [22]:
pd_series42 = pd_series41.sort_values(ascending = True)

In [24]:
pd_series42

0     234
2     256
3     575
5     678
4    1332
1    3454
dtype: int32

In [26]:
pd_series41

0     234
1    3454
2     256
3     575
4    1332
5     678
dtype: int32

In [28]:
pd_series43 = pd_series41.sort_values(ascending = False)

In [32]:
pd_series43

1    3454
4    1332
5     678
3     575
2     256
0     234
dtype: int32

In [34]:
pd_series41

0     234
1    3454
2     256
3     575
4    1332
5     678
dtype: int32

In [ ]:
pd_series41

In [36]:
 pd_series41.sort_index(ascending = False)

5     678
4    1332
3     575
2     256
1    3454
0     234
dtype: int32

### isnull / notnull

In [40]:
pd_series51 = pd.Series(np.array([234,3454, np.nan,575,1332,678]))

In [42]:
pd_series51

0     234.0
1    3454.0
2       NaN
3     575.0
4    1332.0
5     678.0
dtype: float64

In [44]:
pd_series51.isnull()

0    False
1    False
2     True
3    False
4    False
5    False
dtype: bool

In [47]:
pd_series51.notnull()

0     True
1     True
2    False
3     True
4     True
5     True
dtype: bool

## Data Frame

### Reading data tables from external files

In [2]:
df1 = pd.read_csv("lds0.csv")

In [4]:
df1

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started,Listed Date
0,Deccan_Sporting,931,839.None,615,Pvt,NaN,Hyd,1,SPRT,Services,Mar-43
1,Kolkata_FMCG,925,NaN,676,NaN,1379.0,Kol,0,KFMC,Goods,Jan-20
2,NCR_Leagles,931,NaN,605,NaN,1935.0,NCR,0,NCRL,Services,Feb-60
3,Bangalore_Systems,900,NaN,650,Gov,1361.0,Blr,0,BSYS,Services,Apr-50
4,Chennai_Chemicals,966,863.2,608,Pub,1656.0,Che,1,CHEM,Goods,Aug-28
5,Indi_Services,954,733,609,Gov,NaN,NCR,0,INDI,Services,Mar-20
6,Bangalore_Breweries,966,NaN,895,NaN,119.0,Blr,1,BREW,Goods,Oct-71
7,NaN,899,NaN,674,Pub,NaN,Mum,0,BFIN,Services,Apr-25
8,Chennai_Shipping,992,821,665,NaN,NaN,Che,1,SHIP,Goods,Nov-30
9,Eastern_Estates,945,834.23,789,Pvt,1873.0,NaN,1,EEST,Goods,Jan-94
10,Indi_Services,954,733,609,Gov,NaN,NCR,0,INDI,Services,Mar-20

In [ ]:
pd.read_excel()

In [14]:
import zipfile
with zipfile.ZipFile('lds33.zip') as z:
    with z.open('lds33.csv') as f :
        df2 = pd.read_csv(f, header = 0)
        print(df2.head())

        Date    City  Temperature  Humidity
0  15/1/2019  Shimla           11        67
1  15/2/2019  Shimla           12        65
2  15/3/2019  Shimla           11        57
3  15/1/2019  Shimla           11        67
4  15/1/2019    Pune           29        34

In [ ]:
pd.read_csv("somename.txt", sep="\t")

In [ ]:
pd.read_json("somename.json")

In [ ]:
pd.read_html("somename.html")

### Know more about data frame

In [18]:
df1

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started,Listed Date
0,Deccan_Sporting,931,839.None,615,Pvt,NaN,Hyd,1,SPRT,Services,Mar-43
1,Kolkata_FMCG,925,NaN,676,NaN,1379.0,Kol,0,KFMC,Goods,Jan-20
2,NCR_Leagles,931,NaN,605,NaN,1935.0,NCR,0,NCRL,Services,Feb-60
3,Bangalore_Systems,900,NaN,650,Gov,1361.0,Blr,0,BSYS,Services,Apr-50
4,Chennai_Chemicals,966,863.2,608,Pub,1656.0,Che,1,CHEM,Goods,Aug-28
5,Indi_Services,954,733,609,Gov,NaN,NCR,0,INDI,Services,Mar-20
6,Bangalore_Breweries,966,NaN,895,NaN,119.0,Blr,1,BREW,Goods,Oct-71
7,NaN,899,NaN,674,Pub,NaN,Mum,0,BFIN,Services,Apr-25
8,Chennai_Shipping,992,821,665,NaN,NaN,Che,1,SHIP,Goods,Nov-30
9,Eastern_Estates,945,834.23,789,Pvt,1873.0,NaN,1,EEST,Goods,Jan-94
10,Indi_Services,954,733,609,Gov,NaN,NCR,0,INDI,Services,Mar-20

In [20]:
df1.head()

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started,Listed Date
0,Deccan_Sporting,931,839.None,615,Pvt,NaN,Hyd,1,SPRT,Services,Mar-43
1,Kolkata_FMCG,925,NaN,676,NaN,1379.0,Kol,0,KFMC,Goods,Jan-20
2,NCR_Leagles,931,NaN,605,NaN,1935.0,NCR,0,NCRL,Services,Feb-60
3,Bangalore_Systems,900,NaN,650,Gov,1361.0,Blr,0,BSYS,Services,Apr-50
4,Chennai_Chemicals,966,863.2,608,Pub,1656.0,Che,1,CHEM,Goods,Aug-28

In [22]:
df1.tail()

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started,Listed Date
6,Bangalore_Breweries,966,NaN,895,NaN,119.0,Blr,1,BREW,Goods,Oct-71
7,NaN,899,NaN,674,Pub,NaN,Mum,0,BFIN,Services,Apr-25
8,Chennai_Shipping,992,821,665,NaN,NaN,Che,1,SHIP,Goods,Nov-30
9,Eastern_Estates,945,834.23,789,Pvt,1873.0,NaN,1,EEST,Goods,Jan-94
10,Indi_Services,954,733,609,Gov,NaN,NCR,0,INDI,Services,Mar-20

In [24]:
dft = df1.tail()

In [28]:
df1.shape

(11, 11)

In [30]:
dft.shape

(5, 11)

In [32]:
df1.dtypes

Vol             object
Rev              int64
Exp             object
Sector           int64
EmpCnt          object
HQ             float64
MNC             object
StockID          int64
GST             object
Started         object
Listed Date     object
dtype: object

In [34]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Vol          10 non-null     object
 1   Rev          11 non-null     int64
 2   Exp          6 non-null      object
 3   Sector       11 non-null     int64
 4   EmpCnt       7 non-null      object
 5   HQ           6 non-null      float64
 6   MNC          10 non-null     object
 7   StockID      11 non-null     int64
 8   GST          11 non-null     object
 9   Started      11 non-null     object
 10  Listed Date  11 non-null     object
dtypes: float64(1), int64(3), object(7)
memory usage: 1.1+ KB

In [36]:
df1

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started,Listed Date
0,Deccan_Sporting,931,839.None,615,Pvt,NaN,Hyd,1,SPRT,Services,Mar-43
1,Kolkata_FMCG,925,NaN,676,NaN,1379.0,Kol,0,KFMC,Goods,Jan-20
2,NCR_Leagles,931,NaN,605,NaN,1935.0,NCR,0,NCRL,Services,Feb-60
3,Bangalore_Systems,900,NaN,650,Gov,1361.0,Blr,0,BSYS,Services,Apr-50
4,Chennai_Chemicals,966,863.2,608,Pub,1656.0,Che,1,CHEM,Goods,Aug-28
5,Indi_Services,954,733,609,Gov,NaN,NCR,0,INDI,Services,Mar-20
6,Bangalore_Breweries,966,NaN,895,NaN,119.0,Blr,1,BREW,Goods,Oct-71
7,NaN,899,NaN,674,Pub,NaN,Mum,0,BFIN,Services,Apr-25
8,Chennai_Shipping,992,821,665,NaN,NaN,Che,1,SHIP,Goods,Nov-30
9,Eastern_Estates,945,834.23,789,Pvt,1873.0,NaN,1,EEST,Goods,Jan-94
10,Indi_Services,954,733,609,Gov,NaN,NCR,0,INDI,Services,Mar-20

### Creating a new data frame

In [40]:
list1 = ['mks', 'pratcices', 'pandas', 'for', 'ds']

In [42]:
list1

['mks', 'pratcices', 'pandas', 'for', 'ds']

In [44]:
df11 = pd.DataFrame(list1)

In [46]:
df11

           0
0        mks
1  pratcices
2     pandas
3        for
4         ds

In [48]:
list2 = [['mks', 1000], ['pratcices',1231], ['pandas',242433], ['for',342534], ['ds',564]]

In [50]:
df12 = pd.DataFrame(list2)

In [52]:
df12

           0       1
0        mks    1000
1  pratcices    1231
2     pandas  242433
3        for  342534
4         ds     564

In [54]:
df13 = pd.DataFrame(list2, columns=['words', 'numericals'])

In [56]:
df13

       words  numericals
0        mks        1000
1  pratcices        1231
2     pandas      242433
3        for      342534
4         ds         564

In [58]:
dict1 = {
    'name' : ['fnh','gfbgf','dgbdfb','dsf','wdewsd'],
    'age' : [34,43,23,54,45]
}

In [60]:
dict1

{'name': ['fnh', 'gfbgf', 'dgbdfb', 'dsf', 'wdewsd'],
 'age': [34, 43, 23, 54, 45]}

In [62]:
df14 = pd.DataFrame(dict1)

In [64]:
df14

     name  age
0     fnh   34
1   gfbgf   43
2  dgbdfb   23
3     dsf   54
4  wdewsd   45

In [66]:
df15 = pd.DataFrame(dict1, index=['a','b','c','d','e'])

In [68]:
df15

     name  age
a     fnh   34
b   gfbgf   43
c  dgbdfb   23
d     dsf   54
e  wdewsd   45

In [ ]:
# list of dictionaries

In [85]:
listOfdict = [
    {
        'A' : 23213,
        'B' : 23423,
        'C' : 567567
    },
    {
        'A' : 4564,
        'B' : 6467,
        'C' : 45656
    },
    {
        'A' : 75557,
        'B' : 5755
    }
]

In [87]:
df16 = pd.DataFrame(listOfdict)

In [89]:
df16

       A      B         C
0  23213  23423  567567.0
1   4564   6467   45656.0
2  75557   5755       NaN

### Dealing with rows and columns

In [93]:
df1 = pd.read_csv("lds0.csv")
df1

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started,Listed Date
0,Deccan_Sporting,931,839.None,615,Pvt,NaN,Hyd,1,SPRT,Services,Mar-43
1,Kolkata_FMCG,925,NaN,676,NaN,1379.0,Kol,0,KFMC,Goods,Jan-20
2,NCR_Leagles,931,NaN,605,NaN,1935.0,NCR,0,NCRL,Services,Feb-60
3,Bangalore_Systems,900,NaN,650,Gov,1361.0,Blr,0,BSYS,Services,Apr-50
4,Chennai_Chemicals,966,863.2,608,Pub,1656.0,Che,1,CHEM,Goods,Aug-28
5,Indi_Services,954,733,609,Gov,NaN,NCR,0,INDI,Services,Mar-20
6,Bangalore_Breweries,966,NaN,895,NaN,119.0,Blr,1,BREW,Goods,Oct-71
7,NaN,899,NaN,674,Pub,NaN,Mum,0,BFIN,Services,Apr-25
8,Chennai_Shipping,992,821,665,NaN,NaN,Che,1,SHIP,Goods,Nov-30
9,Eastern_Estates,945,834.23,789,Pvt,1873.0,NaN,1,EEST,Goods,Jan-94
10,Indi_Services,954,733,609,Gov,NaN,NCR,0,INDI,Services,Mar-20

In [98]:
df1.iloc[3]['MNC']

'Blr'

In [108]:
df1.iloc[3:7:2]

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started,Listed Date
3,Bangalore_Systems,900,NaN,650,Gov,1361.0,Blr,0,BSYS,Services,Apr-50
5,Indi_Services,954,733,609,Gov,NaN,NCR,0,INDI,Services,Mar-20

In [114]:
df1.iloc[[3,7]]

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started,Listed Date
3,Bangalore_Systems,900,NaN,650,Gov,1361.0,Blr,0,BSYS,Services,Apr-50
7,NaN,899,NaN,674,Pub,NaN,Mum,0,BFIN,Services,Apr-25

In [116]:
df1.loc[[3,7]]

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started,Listed Date
3,Bangalore_Systems,900,NaN,650,Gov,1361.0,Blr,0,BSYS,Services,Apr-50
7,NaN,899,NaN,674,Pub,NaN,Mum,0,BFIN,Services,Apr-25

In [118]:
df16

       A      B         C
0  23213  23423  567567.0
1   4564   6467   45656.0
2  75557   5755       NaN

In [120]:
df1

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started,Listed Date
0,Deccan_Sporting,931,839.None,615,Pvt,NaN,Hyd,1,SPRT,Services,Mar-43
1,Kolkata_FMCG,925,NaN,676,NaN,1379.0,Kol,0,KFMC,Goods,Jan-20
2,NCR_Leagles,931,NaN,605,NaN,1935.0,NCR,0,NCRL,Services,Feb-60
3,Bangalore_Systems,900,NaN,650,Gov,1361.0,Blr,0,BSYS,Services,Apr-50
4,Chennai_Chemicals,966,863.2,608,Pub,1656.0,Che,1,CHEM,Goods,Aug-28
5,Indi_Services,954,733,609,Gov,NaN,NCR,0,INDI,Services,Mar-20
6,Bangalore_Breweries,966,NaN,895,NaN,119.0,Blr,1,BREW,Goods,Oct-71
7,NaN,899,NaN,674,Pub,NaN,Mum,0,BFIN,Services,Apr-25
8,Chennai_Shipping,992,821,665,NaN,NaN,Che,1,SHIP,Goods,Nov-30
9,Eastern_Estates,945,834.23,789,Pvt,1873.0,NaN,1,EEST,Goods,Jan-94
10,Indi_Services,954,733,609,Gov,NaN,NCR,0,INDI,Services,Mar-20

In [126]:
df1.loc[[3,6],['Rev','Sector']]

   Rev  Sector
3  900     650
6  966     895

In [136]:
df1[['Rev','HQ']]

    Rev      HQ
0   931     NaN
1   925  1379.0
2   931  1935.0
3   900  1361.0
4   966  1656.0
5   954     NaN
6   966   119.0
7   899     NaN
8   992     NaN
9   945  1873.0
10  954     NaN

### Sorting data frame

In [139]:
df1.sort_values('Rev')

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started,Listed Date
7,NaN,899,NaN,674,Pub,NaN,Mum,0,BFIN,Services,Apr-25
3,Bangalore_Systems,900,NaN,650,Gov,1361.0,Blr,0,BSYS,Services,Apr-50
1,Kolkata_FMCG,925,NaN,676,NaN,1379.0,Kol,0,KFMC,Goods,Jan-20
0,Deccan_Sporting,931,839.None,615,Pvt,NaN,Hyd,1,SPRT,Services,Mar-43
2,NCR_Leagles,931,NaN,605,NaN,1935.0,NCR,0,NCRL,Services,Feb-60
9,Eastern_Estates,945,834.23,789,Pvt,1873.0,NaN,1,EEST,Goods,Jan-94
5,Indi_Services,954,733,609,Gov,NaN,NCR,0,INDI,Services,Mar-20
10,Indi_Services,954,733,609,Gov,NaN,NCR,0,INDI,Services,Mar-20
4,Chennai_Chemicals,966,863.2,608,Pub,1656.0,Che,1,CHEM,Goods,Aug-28
6,Bangalore_Breweries,966,NaN,895,NaN,119.0,Blr,1,BREW,Goods,Oct-71
8,Chennai_Shipping,992,821,665,NaN,NaN,Che,1,SHIP,Goods,Nov-30

In [141]:
df1.sort_values('Rev', ascending = False)

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started,Listed Date
8,Chennai_Shipping,992,821,665,NaN,NaN,Che,1,SHIP,Goods,Nov-30
4,Chennai_Chemicals,966,863.2,608,Pub,1656.0,Che,1,CHEM,Goods,Aug-28
6,Bangalore_Breweries,966,NaN,895,NaN,119.0,Blr,1,BREW,Goods,Oct-71
5,Indi_Services,954,733,609,Gov,NaN,NCR,0,INDI,Services,Mar-20
10,Indi_Services,954,733,609,Gov,NaN,NCR,0,INDI,Services,Mar-20
9,Eastern_Estates,945,834.23,789,Pvt,1873.0,NaN,1,EEST,Goods,Jan-94
0,Deccan_Sporting,931,839.None,615,Pvt,NaN,Hyd,1,SPRT,Services,Mar-43
2,NCR_Leagles,931,NaN,605,NaN,1935.0,NCR,0,NCRL,Services,Feb-60
1,Kolkata_FMCG,925,NaN,676,NaN,1379.0,Kol,0,KFMC,Goods,Jan-20
3,Bangalore_Systems,900,NaN,650,Gov,1361.0,Blr,0,BSYS,Services,Apr-50
7,NaN,899,NaN,674,Pub,NaN,Mum,0,BFIN,Services,Apr-25

In [143]:
df1.sort_values('Rev')

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started,Listed Date
7,NaN,899,NaN,674,Pub,NaN,Mum,0,BFIN,Services,Apr-25
3,Bangalore_Systems,900,NaN,650,Gov,1361.0,Blr,0,BSYS,Services,Apr-50
1,Kolkata_FMCG,925,NaN,676,NaN,1379.0,Kol,0,KFMC,Goods,Jan-20
0,Deccan_Sporting,931,839.None,615,Pvt,NaN,Hyd,1,SPRT,Services,Mar-43
2,NCR_Leagles,931,NaN,605,NaN,1935.0,NCR,0,NCRL,Services,Feb-60
9,Eastern_Estates,945,834.23,789,Pvt,1873.0,NaN,1,EEST,Goods,Jan-94
5,Indi_Services,954,733,609,Gov,NaN,NCR,0,INDI,Services,Mar-20
10,Indi_Services,954,733,609,Gov,NaN,NCR,0,INDI,Services,Mar-20
4,Chennai_Chemicals,966,863.2,608,Pub,1656.0,Che,1,CHEM,Goods,Aug-28
6,Bangalore_Breweries,966,NaN,895,NaN,119.0,Blr,1,BREW,Goods,Oct-71
8,Chennai_Shipping,992,821,665,NaN,NaN,Che,1,SHIP,Goods,Nov-30

In [145]:
df1.sort_values(['Rev', 'Sector'])

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started,Listed Date
7,NaN,899,NaN,674,Pub,NaN,Mum,0,BFIN,Services,Apr-25
3,Bangalore_Systems,900,NaN,650,Gov,1361.0,Blr,0,BSYS,Services,Apr-50
1,Kolkata_FMCG,925,NaN,676,NaN,1379.0,Kol,0,KFMC,Goods,Jan-20
2,NCR_Leagles,931,NaN,605,NaN,1935.0,NCR,0,NCRL,Services,Feb-60
0,Deccan_Sporting,931,839.None,615,Pvt,NaN,Hyd,1,SPRT,Services,Mar-43
9,Eastern_Estates,945,834.23,789,Pvt,1873.0,NaN,1,EEST,Goods,Jan-94
5,Indi_Services,954,733,609,Gov,NaN,NCR,0,INDI,Services,Mar-20
10,Indi_Services,954,733,609,Gov,NaN,NCR,0,INDI,Services,Mar-20
4,Chennai_Chemicals,966,863.2,608,Pub,1656.0,Che,1,CHEM,Goods,Aug-28
6,Bangalore_Breweries,966,NaN,895,NaN,119.0,Blr,1,BREW,Goods,Oct-71
8,Chennai_Shipping,992,821,665,NaN,NaN,Che,1,SHIP,Goods,Nov-30

In [147]:
df1.sort_values(['Rev', 'Sector'], ascending = False)

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started,Listed Date
8,Chennai_Shipping,992,821,665,NaN,NaN,Che,1,SHIP,Goods,Nov-30
6,Bangalore_Breweries,966,NaN,895,NaN,119.0,Blr,1,BREW,Goods,Oct-71
4,Chennai_Chemicals,966,863.2,608,Pub,1656.0,Che,1,CHEM,Goods,Aug-28
5,Indi_Services,954,733,609,Gov,NaN,NCR,0,INDI,Services,Mar-20
10,Indi_Services,954,733,609,Gov,NaN,NCR,0,INDI,Services,Mar-20
9,Eastern_Estates,945,834.23,789,Pvt,1873.0,NaN,1,EEST,Goods,Jan-94
0,Deccan_Sporting,931,839.None,615,Pvt,NaN,Hyd,1,SPRT,Services,Mar-43
2,NCR_Leagles,931,NaN,605,NaN,1935.0,NCR,0,NCRL,Services,Feb-60
1,Kolkata_FMCG,925,NaN,676,NaN,1379.0,Kol,0,KFMC,Goods,Jan-20
3,Bangalore_Systems,900,NaN,650,Gov,1361.0,Blr,0,BSYS,Services,Apr-50
7,NaN,899,NaN,674,Pub,NaN,Mum,0,BFIN,Services,Apr-25

### rank function in DF

In [150]:
df1

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started,Listed Date
0,Deccan_Sporting,931,839.None,615,Pvt,NaN,Hyd,1,SPRT,Services,Mar-43
1,Kolkata_FMCG,925,NaN,676,NaN,1379.0,Kol,0,KFMC,Goods,Jan-20
2,NCR_Leagles,931,NaN,605,NaN,1935.0,NCR,0,NCRL,Services,Feb-60
3,Bangalore_Systems,900,NaN,650,Gov,1361.0,Blr,0,BSYS,Services,Apr-50
4,Chennai_Chemicals,966,863.2,608,Pub,1656.0,Che,1,CHEM,Goods,Aug-28
5,Indi_Services,954,733,609,Gov,NaN,NCR,0,INDI,Services,Mar-20
6,Bangalore_Breweries,966,NaN,895,NaN,119.0,Blr,1,BREW,Goods,Oct-71
7,NaN,899,NaN,674,Pub,NaN,Mum,0,BFIN,Services,Apr-25
8,Chennai_Shipping,992,821,665,NaN,NaN,Che,1,SHIP,Goods,Nov-30
9,Eastern_Estates,945,834.23,789,Pvt,1873.0,NaN,1,EEST,Goods,Jan-94
10,Indi_Services,954,733,609,Gov,NaN,NCR,0,INDI,Services,Mar-20

In [156]:
df1['Sector'].rank()

0      5.0
1      9.0
2      1.0
3      6.0
4      2.0
5      3.5
6     11.0
7      8.0
8      7.0
9     10.0
10     3.5
Name: Sector, dtype: float64

In [158]:
df1['Sector'].rank(ascending = False)

0      7.0
1      3.0
2     11.0
3      6.0
4     10.0
5      8.5
6      1.0
7      4.0
8      5.0
9      2.0
10     8.5
Name: Sector, dtype: float64

In [160]:
df1

,Vol,Rev,Exp,Sector,EmpCnt,HQ,MNC,StockID,GST,Started,Listed Date
0,Deccan_Sporting,931,839.None,615,Pvt,NaN,Hyd,1,SPRT,Services,Mar-43
1,Kolkata_FMCG,925,NaN,676,NaN,1379.0,Kol,0,KFMC,Goods,Jan-20
2,NCR_Leagles,931,NaN,605,NaN,1935.0,NCR,0,NCRL,Services,Feb-60
3,Bangalore_Systems,900,NaN,650,Gov,1361.0,Blr,0,BSYS,Services,Apr-50
4,Chennai_Chemicals,966,863.2,608,Pub,1656.0,Che,1,CHEM,Goods,Aug-28
5,Indi_Services,954,733,609,Gov,NaN,NCR,0,INDI,Services,Mar-20
6,Bangalore_Breweries,966,NaN,895,NaN,119.0,Blr,1,BREW,Goods,Oct-71
7,NaN,899,NaN,674,Pub,NaN,Mum,0,BFIN,Services,Apr-25
8,Chennai_Shipping,992,821,665,NaN,NaN,Che,1,SHIP,Goods,Nov-30
9,Eastern_Estates,945,834.23,789,Pvt,1873.0,NaN,1,EEST,Goods,Jan-94
10,Indi_Services,954,733,609,Gov,NaN,NCR,0,INDI,Services,Mar-20

In [164]:
df1['Rev'].rank(method = 'min')

0      4.0
1      3.0
2      4.0
3      2.0
4      9.0
5      7.0
6      9.0
7      1.0
8     11.0
9      6.0
10     7.0
Name: Rev, dtype: float64

In [166]:
df1['Rev'].rank(method = 'max')

0      5.0
1      3.0
2      5.0
3      2.0
4     10.0
5      8.0
6     10.0
7      1.0
8     11.0
9      6.0
10     8.0
Name: Rev, dtype: float64

In [168]:
df1['Rev'].rank(method = 'dense')

0     4.0
1     3.0
2     4.0
3     2.0
4     7.0
5     6.0
6     7.0
7     1.0
8     8.0
9     5.0
10    6.0
Name: Rev, dtype: float64